#!/usr/bin/env python3

students = {
	"李红": {"羽毛球班": 100, "乒乓球班": 80},
	"张明": {"羽毛球班": 100, "篮球班": 120},
	"赵鹏": {"羽毛球班": 100, "篮球班": 120},
	"王健": {"羽毛球班": 100},
	"刘丽": {"羽毛球班": 100, "乒乓球班": 80},
	"章云": {"羽毛球班": 100},
	"吴军": {"羽毛球班": 100, "篮球班": 120, "乒乓球班": 80},
	"王刚": {"篮球班": 120},
	"孙亮": {"篮球班": 120},
	"高斌": {"篮球班": 120, "乒乓球班": 80},
	"邓文": {"篮球班": 120, "乒乓球班": 80},
	"赵武": {"篮球班": 120, "乒乓球班": 80},
	"周诺": {"乒乓球班": 80}
}

for name, classes in students.items():
	total_fee = 0
	for cls, fee in classes.items():
		total_fee += fee
	print(f"{name}应该缴纳{total_fee}元")